larrytsai1980/nRF52840-ble-zigbee-dynamic-light-switch/main.c
    if (ZB_TIME_SUBTRACT(current_time, m_device_ctx.button.timestamp) > LIGHT_SWITCH_BUTTON_THRESHOLD)
    {
        short_expired = ZB_TRUE;
    }
    else
    {
        short_expired = ZB_FALSE;
    }

    /* Check if button was released during LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO. */
    if (!bsp_button_is_pressed(button))
    {
        if (!short_expired)
            {
                /* Allocate output buffer and send on/off command. */
                zb_err_code = ZB_GET_OUT_BUF_DELAYED2(light_switch_send_on_off, on_off);
                ZB_ERROR_CHECK(zb_err_code);
            }

        /* Button released - wait for accept next event. */
        m_device_ctx.button.in_progress = ZB_FALSE;
    }
    else
    {
        if (short_expired)
        {
            /* The button is still pressed - allocate output buffer and send step command. */
            zb_err_code = ZB_GET_OUT_BUF_DELAYED2(light_switch_send_step, on_off);
            ZB_ERROR_CHECK(zb_err_code);
            zb_err_code = ZB_SCHEDULE_ALARM(light_switch_button_handler, button, LIGHT_SWITCH_BUTTON_LONG_POLL_TMO);
            ZB_ERROR_CHECK(zb_err_code);
        }
        else
        {
            /* Wait another LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO, until LIGHT_SWITCH_BUTTON_THRESHOLD will be reached. */
            zb_err_code = ZB_SCHEDULE_ALARM(light_switch_button_handler, button, LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO);
            ZB_ERROR_CHECK(zb_err_code);
        }
    }
}

/**@brief Function to be called after find and bind procedure finish.
 *
 * @param[IN]   param   Parameter function is called with.
 */
static zb_void_t zb_find_n_bind_finish_callback(zb_uint8_t param)
{
    UNUSED_PARAMETER(param);
    bsp_board_led_off(ZB_ONGOING_FIND_N_BIND_LED);
}

/**@brief Function to get time left to finish find and bind procedure
 *
 * @returns Time left to finish find and bind procedure
 * 
 * @details If procedure is already finished, function returns zero
 */
static zb_time_t zb_get_time_left_to_finish_find_n_bind(void)
{
    zb_ret_t    zb_err_code             = RET_OK;
    zb_time_t   zb_time_left_to_finish  = 0;

    zb_err_code = ZB_SCHEDULE_GET_ALARM_TIME(zb_find_n_bind_finish_callback, 0, &zb_time_left_to_finish);
    /* Check return code, if RET_NOT_FOUND, callback not scheduled and return 0. */
    if (zb_err_code == RET_NOT_FOUND)
    {
        return 0;
    }
    /* Check returned error code and return value of left time */
    else
    {
        ZB_ERROR_CHECK(zb_err_code);
        return zb_time_left_to_finish;
    }
}

/**@brief Callback to finding and binding procedure.
 * 
 * @param[IN]   status  Procedure status.
 * @param[IN]   addr    Found device address.
 * @param[IN]   ep      Found device endpoint.
 * @param[IN]   cluster Common cluster ID.
 * 
 * @returns Returned boolean value is used to decide if found device's cluster (ID given as parameter) should be bound.
 */
static zb_bool_t zb_finding_binding_cb(zb_int16_t status, zb_ieee_addr_t addr, zb_uint8_t ep, zb_uint16_t cluster)
{
    zb_ret_t    zb_err_code;

    UNUSED_PARAMETER(addr);

    /* Turn on led to indicate ongoing finding and binding procedure. */
    bsp_board_led_on(ZB_ONGOING_FIND_N_BIND_LED);

    /* Check time remaining to finish procedure and cancel callback if scheduled. */
    if (zb_get_time_left_to_finish_find_n_bind() != 0)
    {
        zb_err_code = ZB_SCHEDULE_ALARM_CANCEL(zb_find_n_bind_finish_callback, 0);
        ZB_ERROR_CHECK(zb_err_code);
    }
    /* Schedule callback when procedure finish. */
    zb_err_code = ZB_SCHEDULE_ALARM(zb_find_n_bind_finish_callback, 0, FIND_N_BIND_TIMEOUT);
    ZB_ERROR_CHECK(zb_err_code);

    NRF_LOG_INFO("Finding binding callback, status %hd, ep %hd, cluster %hd", status, ep, cluster);

    /* Try to bind to every onoff/level control Cluster on any found devices. */
    if ((status == ZB_BDB_COMM_BIND_ASK_USER)
        && ((cluster == ZB_ZCL_CLUSTER_ID_ON_OFF)||(cluster == ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL)))
    {
        return ZB_TRUE;
    }
    else
    {
        return ZB_FALSE;
    }
}

/**@brief Callback for button events.
 *
 * @param[in]   evt      Incoming event from the BSP subsystem.
 */
static void buttons_handler(bsp_event_t evt)
{
    zb_ret_t zb_err_code;
    zb_uint32_t button;
    zb_time_t zb_time_left_to_finish;

    switch(evt)
    {
        case BSP_EVENT_KEY_0:
            button = LIGHT_SWITCH_BUTTON_ON;
            break;

        case BSP_EVENT_KEY_1:
            button = LIGHT_SWITCH_BUTTON_OFF;
            break;

        case BSP_EVENT_KEY_3:
            /* Check that find and bind procedure is not going start procedure and callback to be called when procedure finish. */
            zb_time_left_to_finish = zb_get_time_left_to_finish_find_n_bind();
            if (zb_time_left_to_finish == 0)
            {
                zb_err_code = zb_bdb_finding_binding_initiator(LIGHT_SWITCH_ENDPOINT, zb_finding_binding_cb);
                ZB_ERROR_CHECK(zb_err_code);
                zb_err_code = ZB_SCHEDULE_ALARM(zb_find_n_bind_finish_callback, 0, FIND_N_BIND_TIMEOUT);
                ZB_ERROR_CHECK(zb_err_code);
                /* Turn on led to indicate ongoing finding and binding procedure. */
                bsp_board_led_on(ZB_ONGOING_FIND_N_BIND_LED);
            }
            else
            {
                NRF_LOG_INFO("Time to finish find and bind procedure: %ld", zb_time_left_to_finish);
            }
            break;

        default:
            NRF_LOG_INFO("Unhandled BSP Event received: %d", evt);
            return;
    }

    if((evt == BSP_EVENT_KEY_0)||(evt == BSP_EVENT_KEY_1))
    {
        if (!m_device_ctx.button.in_progress)
        {
            m_device_ctx.button.in_progress = ZB_TRUE;
            m_device_ctx.button.timestamp = ZB_TIMER_GET();

            zb_err_code = ZB_SCHEDULE_ALARM(light_switch_button_handler, button, LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO);
            ZB_ERROR_CHECK(zb_err_code);
        }
    }
}


/**@brief Function for initializing LEDs and buttons.
 */
static void leds_buttons_init(void)
{
    ret_code_t error_code;

    /* Initialize LEDs and buttons - use BSP to control them. */
    error_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, buttons_handler);
    APP_ERROR_CHECK(error_code);
    /* By default the bsp_init attaches BSP_KEY_EVENTS_{0-4} to the PUSH events of the corresponding buttons. */

    bsp_board_leds_off();
}

/**@brief Function for handling commands received from the Nordic UART Service.
 *
 * @details This function will check received data agains predefined commands and
 *          generate a corresponding Zigbee request upon successfull match.
 *
 * @param[in] p_command_str  Command string received over UART.
 * @param[in] length         Length of the data.
 */
static void zigbee_command_handler(const uint8_t * p_command_str, uint16_t length)
{
    ret_code_t err_code;
    int32_t    delay;

    if (strncmp(COMMAND_ON, (char *)p_command_str, strlen(COMMAND_ON)) == 0)
    {
        UNUSED_RETURN_VALUE(ZB_GET_OUT_BUF_DELAYED2(light_switch_send_on_off, 1));
    }
    else if (strncmp(COMMAND_OFF, (char *)p_command_str, strlen(COMMAND_OFF)) == 0)
    {
        UNUSED_RETURN_VALUE(ZB_GET_OUT_BUF_DELAYED2(light_switch_send_on_off, 0));
    }
    else if (strncmp(COMMAND_TOGGLE, (char *)p_command_str, strlen(COMMAND_TOGGLE)) == 0)
    {
        UNUSED_RETURN_VALUE(ZB_GET_OUT_BUF_DELAYED(light_switch_send_toggle));
    }
    else if (strncmp(COMMAND_INCREASE, (char *)p_command_str, strlen(COMMAND_INCREASE)) == 0)
    {
        UNUSED_RETURN_VALUE(ZB_GET_OUT_BUF_DELAYED2(light_switch_send_step, 1));
    }
    else if (strncmp(COMMAND_DECRESE, (char *)p_command_str, strlen(COMMAND_DECRESE)) == 0)
    {
        UNUSED_RETURN_VALUE(ZB_GET_OUT_BUF_DELAYED2(light_switch_send_step, 0));
    }
    else if (length < 4)
    {
        delay = strtol((const char *)p_command_str, NULL, 10);

        /* Check for parsing errors. */
        if ((delay == 0) && ((length != 1) || (p_command_str[0] != '0')))
        {
            NRF_LOG_INFO("Unrecognized UART command received:");
            NRF_LOG_HEXDUMP_INFO(p_command_str, length);
            return;
        }

